import React from 'react';

const faqs = [
    {
        question: "با سرویس های شما از طریق چه کشوری به صرافی ها متصل می‌شم؟",
        answer: (
            <p>
                تو سرویس حرفه ای شما می‌تونید <span className="text-indigo-500">هر کشوری</span> رو که مدنظر داشته باشید انتخاب
                کنید تا تحریم‌شکن شما رو با تنظیمات همون‌کشور براتون پیاده سازی کنیم.
                اگر که کشور خاصی مدنظر‌تون نیست، ما کشور <span className='text-indigo-500'>ارمنستان</span> رو به دلیل نزدیکی به
                ایران و سرور های با کیفیتی که داره پیشنهاد می‌دیم.
            </p>
        ),
    },
    {
        question: "ممکنه بدون اطلاع من آی پی یا کشور سرورهاتون رو عوض کنید؟",
        answer:
            <p>خیر، اگه یه موقع واقعا یه مشکل فنی ای به وجود بیاد که مجبور به عوض کردن آی‌پی تون بشیم
                <span className='text-indigo-500'> حتما قبلش با شما تماس گرفته شده </span>
                و هماهنگی های لازم باهاتون انجام میشه.

            </p>

    },
    {
        question: "چرا سرویس های شما ایمن تر از محصولات مشابه تو بازار هست؟",
        answer:
            <p>
                سرویس های ما به صورتی پیاده سازی شده که اطلاعات شما قبل از رسیدن به صرافی ها از
                چندین سرور میانی عبور کرده تا امنیت اطلاعات تظمین بشه و صرافی نتونه به راحتی بفهمه که درخواست اصلی از چه کشوری فرستاده شده. در کنار این مکانیزم، سرور رو به نحوی تنظیم می‌کنیم که
                اتصال‌تون به صرافی <span className='text-indigo-500'>کاملا شبیه سازی شده</span> کشور مد‌نظرتون باشه تا جای شکی باقی نگذاره.

            </p>
    },
    {
        question: "تحریم‌شکن سفارشی چه برتری ای نسبت به مدل پایه داره؟",
        answer:
            <p>
                شما می‌تونید هر کشوری رو که دوست دارید برای این تحریم‌شکن انتخاب کنید و <span className='text-indigo-500'>آی‌پی اختصاصی‌تون یک نفره و مختص خودتون هست</span> و هیچکس دیگه ای با این ‌آی‌پی نمی‌تونه به صرافی شما یا هیچ صرافی دیگه ای متصل بشه.
                بنابراین امنیت بسیار بالایی داره و نیاز های خاص شما رو برای امنیت و سرعت  می‌تونه برطرف کنه.
                این سرویس با توجه به اینکه برای کار های حساسی استفاده می‌شه تو اولویت پشتیبانی قرار می‌گیره.

            </p>
    },
    {
        question: "چطوری می‌تونم از کیفیت سرویس های شما مطمئن بشم؟",
        answer:
            <div>
                <p>
                    فقط کافیه رو لینک زیر بزنید و <span className='font-bold text-indigo-500'>رایگان</span> کیفیت، سرعت و امنیت این سرویس رو امتحان کنید
                </p>
                <a href="https://app.eementrade.com/#/login?gS=1&sT=Tr" target='_blank'>
                    <button
                        class="mt-4 ml-10 px-4 py-2 bg-indigo-500 text-white rounded">
                        دریافت سرویس
                    </button>
                </a>
            </div>
    },
    {
        question: "شرایط گارانتی بازگشت وجه به چه صورت هست؟",
        answer:
            <p>
                در هر نقطه ای که از خدمات ما استفاده می‌کنی، اگه که نتونستیم اون تجربه خوشایندی که باید رو براتون فراهم کنیم می‌تونید <span className='text-indigo-500'>بدون هیچ محدودیتی</span> درخواست استفاده از این گارانتی رو بدید تا هزینه سرویس <span className='text-indigo-500'>به طور کامل</span> به حساب شما برگشت داده بشه.

            </p>
    },
    {
        question: "تحویل سرویس به چه صورت انجام می‌شود؟",
        answer:
            "پس از خرید سرویس اطلاعات سرویس برای شما پیامک  شده و از طریق پنل کاربری شما قابل دسترس است.",
    },
    {
        question: "پرداخت به چه شیوه هایی انجام می‌شود؟",
        answer:
            "خرید سرویس ها با تمام کارت های عضو شتاب بانک های معتبر کشور قابل انجام است. ",
    },
    {
        question: "چجوری از این سرویس ها باید استفاده کنم؟",
        answer:
            "نحوه کامل استفاده و نرم افزار های مورد نیاز از طریق پیامک و ایمیل به شما اطلاعی رسانی می‌شود و همینطور در پنل کاربری تون هم هست. هر سوالی هم داشته باشید می‌تونید از تیم پشتیباین تو تلگرام بپرسید و یا درخواست پشتیبانی تلفنی بدید تا هر چه زودتر به سوال‌تون پاسخ بدیم.",
    },
    {
        question: "چطوری از وضعیت سرویسی که خریداری کردم با خبر بشم؟ ",
        answer:
            "ما خودمون با استفاده از پیامک و ایمیل خبر های مهم رو به شما می‌دیم. اگه خودتون هم خواستید وضعیت سرویس رو بررسی کنید به راحتی از طریق پنل کاربری تون می‌تونید این کار رو انجام بدید.",
    },
    {
        question: "اگر سوالی درباره استفاده از سرویس داشتم از کی بپرسم؟",
        answer:
            "تیم پشتیبانی ما از طریق شماره پشتیبانی و در تلگرام پاسخگوی سوالات شماست.",
    },
    {
        question: "چجوری به آموزش های شما دسترسی پیدا کنم؟",
        answer:
            "هر موقع که لازم داشته باشی آموزش های مهم به همراه نرم افزار های کاربردی تو پنل کاربریتون هست. اگه به پشتیبانی تلفنی نیاز داشتید می‌تونید از طریق تلگرام درخواستش رو ثبت کنید تا هر چه زودتر با شما تماس گرفته بشه.",
    },
];

const FaqList = () => {
    return (
        <div>
            <div className="mt-16 text-center">
                <h1 className="text-4xl lg:text-5xl font-bold lg:tracking-tight">
                    سوالات متداول
                </h1>
                <p className="text-lg mt-4 text-slate-500 mx-auto max-w-xl">
                    پاسخ به سوالات متداول شما
                </p>
            </div>
            <div className="grid divide-y divide-neutral-200 max-w-xl mx-auto mt-8">
                {faqs.map((item) => (
                    <div className="py-5" key={item.question}>
                        <details className="group">
                            <summary className="flex justify-between items-center font-medium cursor-pointer list-none">
                                <span>{item.question}</span>
                                <span className="transition group-open:rotate-180 ">
                                    <svg
                                        fill="none"
                                        height="24"
                                        shapeRendering="geometricPrecision"
                                        stroke="currentColor"
                                        strokeLinecap="round"
                                        strokeLinejoin="round"
                                        strokeWidth="1.5"
                                        viewBox="0 0 24 24"
                                        width="24"
                                    >
                                        <path d="M6 9l6 6 6-6" />
                                    </svg>
                                </span>
                            </summary>
                            <div className="text-neutral-600 mt-3 group-open:animate-fadeIn text-justify pl-10">
                                {item.answer}
                            </div>
                        </details>
                    </div>
                ))}
            </div>
        </div>
    );
};

export default FaqList;
